Catalogs/упРасписанияПериодическихРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упРасписанияПериодическихРейсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоТочекВРейсе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутСледования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТиповыеМаршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменятьМаршрутСледованияРейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Зоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗонаОтправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаПолучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОтправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПолучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упРасписанияПериодическихРейсов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.Организация) Тогда 
		Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;	

	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимость();	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипТСПриИзменении(Элемент)
	
	ОбновитьВидимость();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьМаршрутСледованияРейсаПриИзменении(Элемент)
	
	ОбновитьВидимость();
	
КонецПроцедуры


&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
	
	СоглашениеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	сткПараметры = Новый Структура("ВидПеревозки, Перевозчик, Организация", Объект.ВидПеревозки, Объект.Перевозчик, Объект.Организация);
	ОткрытьФорму("Справочник.упТипыТС.Форма.ФормаВыбора", сткПараметры, Элемент);
	СтандартнаяОбработка = Ложь;
 
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	сткПараметры = Новый Структура("ВидПеревозки, Перевозчик, Организация, ТипТС", Объект.ВидПеревозки, Объект.Перевозчик, Объект.Организация, Объект.ТипТС);
	ОткрытьФорму("Справочник.упТранспортныеСредства.Форма.ФормаВыбора", сткПараметры, Элемент);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	
	ТранспортноеСредствоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗоныАдресОтправленияПриИзменении(Элемент)
	
	идСтроки = Элементы.Зоны.ТекущаяСтрока;
	АдресОтправленияПриИзмененииНаСервере(идСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗоныАдресПолученияПриИзменении(Элемент)
	
	идСтроки = Элементы.Зоны.ТекущаяСтрока;
	АдресПолученияПриИзмененииНаСервере(идСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
	Элемент.ТекстРедактирования, 
	ЭтотОбъект, 
	"Объект.Комментарий");
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	упСервисныеФункцииКлиент.РедактироватьПериод(Объект, Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачалаДействия", "ДатаОкончанияДействия"));
		
КонецПроцедуры // УстановитьИнтервал()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		сткЗначенияРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ТранспортноеСредство, Новый Структура("Перевозчик, ТипТС","Партнер", "ТипТС"));
		ЗаполнитьЗначенияСвойств(Объект, сткЗначенияРеквизиты);
		Элементы.Перевозчик.ТолькоПросмотр = Истина;
		Элементы.ТипТС.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
КонецПроцедуры // ТранспортноеСредствоПриИзмененииНаСервере()

&НаСервере
Процедура АдресОтправленияПриИзмененииНаСервере(Идентификатор)
	
	текСтрока = Объект.Зоны.НайтиПоИдентификатору(Идентификатор);
	Если текСтрока <> Неопределено И ЗначениеЗаполнено(текСтрока.АдресОтправления) Тогда
	    текСтрока.ЗонаОтправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текСтрока.АдресОтправления, "ГеографическаяЗона");
	КонецЕсли; 
	
КонецПроцедуры // АдресОтправленияПриИзмененииНаСервере();

&НаСервере
Процедура АдресПолученияПриИзмененииНаСервере(Идентификатор)
	
	текСтрока = Объект.Зоны.НайтиПоИдентификатору(Идентификатор);
	Если текСтрока <> Неопределено И ЗначениеЗаполнено(текСтрока.АдресПолучения) Тогда
	    текСтрока.ЗонаПолучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текСтрока.АдресПолучения, "ГеографическаяЗона");
	КонецЕсли; 
	
КонецПроцедуры // АдресПолученияПриИзмененииНаСервере();

&НаСервере
Процедура СоглашениеПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		сткПериодДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Соглашение, "ДатаНачалаДействия, ДатаОкончанияДействия");
		Если ЗначениеЗаполнено(сткПериодДействия.ДатаНачалаДействия) Или ЗначениеЗаполнено(сткПериодДействия.ДатаОкончанияДействия) Тогда
			ЗаполнитьЗначенияСвойств(Объект, сткПериодДействия);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // СоглашениеПриИзмененииНаСервере()

&НаСервере
Процедура ОбновитьВидимость()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Элементы.Перевозчик.ТолькоПросмотр = Истина;
		Элементы.ТипТС.ТолькоПросмотр = Истина;
	КонецЕсли;
	Элементы.МаршрутСледования.Доступность               = Объект.ИзменятьМаршрутСледованияРейса;
	Элементы.МаршрутСледования.АвтоОтметкаНезаполненного = Объект.ИзменятьМаршрутСледованияРейса;
	
КонецПроцедуры // ОбновитьВидимость()

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти
